#Можако 4 вариант
print("start code ...")
# Создаём список книг, где каждая книга представлена в виде словаря
books = [
    {"title": "Война и мир", "author": "Лев Толстой", "year": 1869},
    {"title": "Дом, в котором", "author": "Мариам Петросян", "year": 2009},
    {"title": "Мастер и Маргарита", "author": "Михаил Булгаков", "year": 1967},
    {"title": "1984", "author": "Джордж Оруэлл", "year": 1949},
    {"title": "Преступление и наказание", "author": "Фёдор Достоевский", "year": 1866}
]

# Проходим по каждой книге в списке и выводим информацию в заданном формате
for i, book in enumerate(books, start=1):
    print(f"---------------------- Книга {i} -----------------------")
    print(f"Название: {book['title']}, Автор: {book['author']},")
    print(f"-------------------------{book['year']}-------------------------")
    print()  # Добавляем пустую строку для разделения книг
print("... end code")